#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/testbuildpleaseignore/testbuildpleaseignore/runs/run-7fv7EYB8ab74ef64

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_eip.nat: Refreshing state... [id=eipalloc-0f240680146d7f6c9]
aws_ecr_repository.api-ecr: Refreshing state... [id=api]
aws_ecr_repository.web-ecr: Refreshing state... [id=web]
aws_cloudwatch_log_group.web: Refreshing state... [id=/ecs/web]
aws_secretsmanager_secret.pg_password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:621387225812:secret:pg_password-ygBFFN]
aws_ecs_cluster.app: Refreshing state... [id=arn:aws:ecs:us-east-1:621387225812:cluster/app]
aws_cloudwatch_log_group.api: Refreshing state... [id=/ecs/api]
aws_vpc.main: Refreshing state... [id=vpc-04d2251cd6b6fe059]
aws_rds_cluster.postgresql: Refreshing state... [id=aurora-cluster]
aws_iam_role.tbpi_task_execution_role: Refreshing state... [id=tbpi-task-execution-role]
aws_secretsmanager_secret_version.pg_password_value: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:621387225812:secret:pg_password-ygBFFN|03F00597-B501-4F43-B57C-317CAFB6804B]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=tbpi-task-execution-role:password-policy-secretsmanager]
aws_ecs_task_definition.api: Refreshing state... [id=api]
aws_subnet.public_d: Refreshing state... [id=subnet-0f442550635c8cfaa]
aws_subnet.private_d: Refreshing state... [id=subnet-01f4e3ee3d8597354]
aws_internet_gateway.igw: Refreshing state... [id=igw-0a7d40d7d4e4f8716]
aws_subnet.private_c: Refreshing state... [id=subnet-0cb6f889d7740e8e8]
aws_subnet.private_e: Refreshing state... [id=subnet-0576a0d341e031959]
aws_route_table.private: Refreshing state... [id=rtb-06c50b9b738de09c2]
aws_subnet.public_e: Refreshing state... [id=subnet-0ababdb621af5bc6a]
aws_route_table.public: Refreshing state... [id=rtb-0ca25eee35bcb3742]
aws_security_group.http: Refreshing state... [id=sg-03b60c884a147a009]
aws_security_group.egress_all: Refreshing state... [id=sg-0a72c9346f3703987]
aws_security_group.ingress_api: Refreshing state... [id=sg-0022b382aaa9f8140]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=tbpi-task-execution-role-20220403213404601400000001]
aws_nat_gateway.ngw: Refreshing state... [id=nat-0314c755c04f4621c]
aws_route_table_association.public_d_subnet: Refreshing state... [id=rtbassoc-038c27e2ca8931400]
aws_route.public_igw: Refreshing state... [id=r-rtb-0ca25eee35bcb37421080289494]
aws_route_table_association.private_d_subnet: Refreshing state... [id=rtbassoc-05912559b388e973c]
aws_route_table_association.private_e_subnet: Refreshing state... [id=rtbassoc-01b48f5d167b4feb5]
aws_route_table_association.public_e_subnet: Refreshing state... [id=rtbassoc-0dfd8fb1e86e68a40]
aws_route_table_association.private_c_subnet: Refreshing state... [id=rtbassoc-028dfbb4010d4bb03]
aws_route.private_ngw: Refreshing state... [id=r-rtb-06c50b9b738de09c21080289494]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/alb/8b585a4740025a7e]
aws_lb_target_group.web: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:targetgroup/web/cfb56f4064bc0dbf]
aws_ecs_task_definition.web: Refreshing state... [id=web]
aws_lb_target_group.api: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:targetgroup/api/86c734428b543363]
aws_alb_listener.web_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/alb/8b585a4740025a7e/60d11c137bc1e10f]
aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-east-1:621387225812:service/app/web]
aws_alb_listener.api_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/alb/8b585a4740025a7e/5095088711279c88]
aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:us-east-1:621387225812:service/app/api]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecs_service.api has changed
  ~ resource "aws_ecs_service" "api" {
        id                                 = "arn:aws:ecs:us-east-1:621387225812:service/app/api"
        name                               = "api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:621387225812:task-definition/api:14" -> "arn:aws:ecs:us-east-1:621387225812:task-definition/api:16"
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.web has changed
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-east-1:621387225812:service/app/web"
        name                               = "web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:621387225812:task-definition/web:13" -> "arn:aws:ecs:us-east-1:621387225812:task-definition/web:15"
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.api must be replaced
-/+ resource "aws_ecs_task_definition" "api" {
      ~ arn                      = "arn:aws:ecs:us-east-1:621387225812:task-definition/api:7" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "api" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 7 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
      - task_role_arn            = "" -> null
        # (7 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.web must be replaced
-/+ resource "aws_ecs_task_definition" "web" {
      ~ arn                      = "arn:aws:ecs:us-east-1:621387225812:task-definition/web:12" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ environment      = [
                      ~ {
                          ~ value = "http://alb-1487368739.us-east-1.elb.amazonaws.com" -> "http://alb-1487368739.us-east-1.elb.amazonaws.com:3000"
                            # (1 unchanged element hidden)
                        },
                      + {
                          + name  = "PORT"
                          + value = "80"
                        },
                    ]
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (3 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "web" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.


```

</details>

*Pusher: @bdharris08, Action: `pull_request`*